# Лабораторная работа 1

В данной лабораторной работе решаются 2 задачи:

## Задача 1

Файл с данными имеет некоторые дефекты: во многих числовых клетках значения поделены пробелами, из-за чего R воспринимает их как строковые значения.
Необходимо написать функцию, которая получает на вход набор данных, у которого в некоторых значениях числовых переменных добавлен пробел между цифрами. Нужно избавиться от этого пробела и вернуть числовым переменным их числовой тип. Функция должна возвращать преобразованный набор данных, в котором все числовые переменные будут переведены в числовой тип, при этом те переменные, которые действительно являются строковыми никак преобразовывать не надо.

Все данные хранятся в файде test_data_01.csv.

Задача решается при помощи следующей функции **fix_data**:

```R

fix_data <- function(df){
  for (row in df){
    for (cell in row){
      if (!grepl("[a-zA-Z]", cell)){
        df[df == cell] <- gsub(" ", "", cell)
      }
    }
  }
  return(df)
}

```

**Входные данные:** 
* **df** - датафрейм, содержащий некоторый набор данных.

**Выходные данные:**
* **means** - преобразованный набор данных без дефекта с пробелами внутри чисел

Применение приведенной функции на реальных данных:

```R

data <- read.csv("test_data_01.csv")
processed_data <- fix_data(data)
print(processed_data)

```

Результаты на выходе:

```R

       V1      V2      V3      V4      V5
1 -2.5935    II 2  0.4984 ST 123E -2.1544
2 -0.2888 ST 123E  1.5636 ST 123E  0.1053
3 -0.8286 ST 123E -0.9791  HP 129 -0.4989
4  -0.322 ST 123E -0.3013  HP 129 -0.4032
5 -0.5588 ST 123E  1.2694  HP 129  0.7039

```

## Задача 2

В рамках некоторого медицинского исследования тестировалась эффективность новой вакцины.
Одной из целей исследования являлось изучить динамику температуры тела пациентов на протяжении недели после вакцинации.
Пациенты должны были каждый день приходить на осмотр, где у них измеряли температуру. Каждый из семи дней экспериментатор вносил в таблицу id пациента и его температуру.
После окончания исследования выяснилось, что некоторые пациенты не смогли посетить все семт приемов, кто- то после первого раза больше не приходил, кто-то пропустил некоторые дни и т. д.Для числоты исследования необходимо отобрать только тех пациентов, кто посетил каждый из семи приемов. 

Все данные хранятся в файде data.RData в следующем формате: в списке data сохранены семь датафоеймов, с двумя колонками:

* **id** - закодированное имя пациента
* **temp** - значение температуры

Задача решается при помощи следующей функции **get_id**: 

```R

get_id <- function(df){
  temp_df <- join_all(data, by = 'id', type = 'inner')
  means <- data.frame(id = temp_df[, 1], temperature = rowMeans(temp_df[, -1]))
  return(means)
}

```

**Входные данные:** 
* **df** - список из датафреймов по дням посещений, содержащие значения температуры по каждому пациенту

**Выходные данные:**
* **means** - датафрейм со средними значениями темпеературы по пациентам, не пропустившими ни одного измерения данных о температуре

Применение приведенной функции на реальных данных:

```R

library(plyr)
load("data.RData")
result <- get_id(data)
print(result)

```

Результаты на выходе:

```R

   id temperature
1   4    36.34524
2  18    36.74270
3   1    36.37046
4   3    36.73910
5  10    36.45994
6   9    36.73481
7   5    36.83133
8   8    36.73740
9  11    36.52647
10 14    36.39976
11  2    36.65626
12 19    36.74740
13  6    36.54502
14  7    36.66947

```
